resources/nodoAttivaRPT.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ppt="http://ppt.pagamenti.telematici.gov/" xmlns:pag="http://www.digitpa.gov.it/schemas/2011/Pagamenti/">
  <soap:Header />
  <soap:Body>
    <ppt:nodoAttivaRPT>
      <identificativoPSP>?</identificativoPSP>
      <identificativoIntermediarioPSP>?</identificativoIntermediarioPSP>
      <identificativoCanale>?</identificativoCanale>
      <password>password</password>
      <codiceContestoPagamento>?</codiceContestoPagamento>
      <identificativoIntermediarioPSPPagamento>?</identificativoIntermediarioPSPPagamento>
      <identificativoCanalePagamento>?</identificativoCanalePagamento>
      <codificaInfrastrutturaPSP>?</codificaInfrastrutturaPSP>
      <codiceIdRPT>
        <!--You may enter ANY elements at this point-->
      </codiceIdRPT>
      <datiPagamentoPSP>
        <importoSingoloVersamento>?</importoSingoloVersamento>
        <!--Optional:-->
        <ibanAppoggio>?</ibanAppoggio>
        <!--Optional:-->
        <bicAppoggio>?</bicAppoggio>
        <!--Optional:-->
        <soggettoVersante>
          <pag:identificativoUnivocoVersante>
            <pag:tipoIdentificativoUnivoco>?</pag:tipoIdentificativoUnivoco>
            <pag:codiceIdentificativoUnivoco>?</pag:codiceIdentificativoUnivoco>
          </pag:identificativoUnivocoVersante>
          <pag:anagraficaVersante>?</pag:anagraficaVersante>
          <!--Optional:-->
          <pag:indirizzoVersante>?</pag:indirizzoVersante>
          <!--Optional:-->
          <pag:civicoVersante>?</pag:civicoVersante>
          <!--Optional:-->
          <pag:capVersante>?</pag:capVersante>
          <!--Optional:-->
          <pag:localitaVersante>?</pag:localitaVersante>
          <!--Optional:-->
          <pag:provinciaVersante>?</pag:provinciaVersante>
          <!--Optional:-->
          <pag:nazioneVersante>?</pag:nazioneVersante>
          <!--Optional:-->
          <pag:e-mailVersante>?</pag:e-mailVersante>
        </soggettoVersante>
        <!--Optional:-->
        <ibanAddebito>?</ibanAddebito>
        <!--Optional:-->
        <bicAddebito>?</bicAddebito>
        <!--Optional:-->
        <soggettoPagatore>
          <pag:identificativoUnivocoPagatore>
            <pag:tipoIdentificativoUnivoco>?</pag:tipoIdentificativoUnivoco>
            <pag:codiceIdentificativoUnivoco>?</pag:codiceIdentificativoUnivoco>
          </pag:identificativoUnivocoPagatore>
          <pag:anagraficaPagatore>?</pag:anagraficaPagatore>
          <!--Optional:-->
          <pag:indirizzoPagatore>?</pag:indirizzoPagatore>
          <!--Optional:-->
          <pag:civicoPagatore>?</pag:civicoPagatore>
          <!--Optional:-->
          <pag:capPagatore>?</pag:capPagatore>
          <!--Optional:-->
          <pag:localitaPagatore>?</pag:localitaPagatore>
          <!--Optional:-->
          <pag:provinciaPagatore>?</pag:provinciaPagatore>
          <!--Optional:-->
          <pag:nazionePagatore>?</pag:nazionePagatore>
          <!--Optional:-->
          <pag:e-mailPagatore>?</pag:e-mailPagatore>
        </soggettoPagatore>
      </datiPagamentoPSP>
    </ppt:nodoAttivaRPT>
  </soap:Body>
</soap:Envelope>